In the current problem scenario we have to calculate the salary of a candidate based on
its experice, test score and interview score by using simple linear regression technique.

In [45]:
import pandas as pd

In [46]:
df = pd.read_csv('candidates.csv')

In [47]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

__Data cleaning and pre-processing needs to be done.__

In [48]:
df.experience.fillna('zero',inplace=True)

In [49]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [9]:
pip install word2number

Collecting word2number
  Downloading word2number-1.1.zip (9.7 kB)
Building wheels for collected packages: word2number
  Building wheel for word2number (setup.py): started
  Building wheel for word2number (setup.py): finished with status 'done'
  Created wheel for word2number: filename=word2number-1.1-py3-none-any.whl size=5591 sha256=9389de5f8ae6a0578dce98302f9dccfa269019a5ac51147b3a7a3ed82afdbe2b
  Stored in directory: c:\users\lenovo\appdata\local\pip\cache\wheels\cb\f3\5a\d88198fdeb46781ddd7e7f2653061af83e7adb2a076d8886d6
Successfully built word2number
Installing collected packages: word2number
Successfully installed word2number-1.1
Note: you may need to restart the kernel to use updated packages.

__This is a Python module to convert number words (eg. twenty one) to numeric digits (21). It works for positive numbers upto the range of 999,999,999,999 (i.e. billions).__
Ref : https://pypi.org/project/word2number/

In [50]:
from word2number import w2n

In [51]:
#Converting the numeric words to numbers
df.experience = df.experience.apply(w2n.word_to_num)

In [52]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [53]:
#Substituting NaN value with the mean of test score column
df['test_score(out of 10)'].fillna(df['test_score(out of 10)'].mean(),inplace=True)

In [54]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0               8.000000                           9      50000
1           0               8.000000                           6      45000
2           5               6.000000                           7      60000
3           2              10.000000                          10      65000
4           7               9.000000                           6      70000
5           3               7.000000                          10      62000
6          10               7.857143                           7      72000
7          11               7.000000                           8      80000

__Now our dataset is complete and clean.__

In [55]:
from sklearn import linear_model

In [56]:
reg = linear_model.LinearRegression()

In [57]:
reg.fit(df[['experience','test_score(out of 10)','interview_score(out of 10)']],df['salary($)'])

LinearRegression()

In [58]:
reg.predict([[5,6,7]])

array([58231.95591138])

__Predicted salary from 3rd row of our dataset is very near to the actual salary(60000).__

__Let's predict salary for random persons based on their experience, test score and interview score.__

In [59]:
reg.predict([[2,9,6]])

array([53290.89255945])

In [60]:
reg.predict([[12,10,10]])

array([92268.07227784])